stress-test/lambda/sample.yml
config:
  target: "api 혹은 cloudfront 주소"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up - 초기 연결 확보"
    - duration: 180
      arrivalRate: 10
      rampTo: 100
      name: "Ramp up - 동시성 한계점 탐색"
    - duration: 300
      arrivalRate: 100
      name: "Sustained Load - 1,000 동시성 근접 유지"

  # CloudFront 캐시를 우회하기 위한 랜덤 변수 설정
  payload:
    path: "data.csv" # 필요시 데이터 파일 사용
    fields:
      - "userId"

scenarios:
  - name: "Lambda Heavy Workload"
    flow:
      - get:
          # URL 뒤에 랜덤 쿼리를 붙여 캐시 히트를 방지하고 Lambda까지 도달하게 함
          url: "/api/test?cacheBust={{ $randomString() }}&user={{ userId }}"
          # 필요 시 헤더 추가
          headers:
            x-api-key: "your-secret-key"